nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/gsm/SMS.c
						memset(DomainNameStr,0,sizeof(DomainNameStr));					  
						memset(SysConf_struct.DNSR,0,sizeof(DomainNameStr));  
						memcpy(DomainNameStr,(char*)pstrTempStart,cmdLen);
						memcpy(SysConf_struct.DNSR,(char*)pstrTempStart,cmdLen);
						Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
						//----- 传给 GSM 模块------
						DataLink_DNSR_Set(SysConf_struct.DNSR,1); 

						// ------ 判断域名内容-------
						res=memcmp((u8*)DomainNameStr,"jt1.gghypt.net",14);
						if(res)
							type_vech(2); // 货运     
						
						//
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);

						//------- add on 2013-6-6
						if(ACKstate==SMS_ACK_none)
						     SD_ACKflag.f_CentreCMDack_0001H=2 ;//DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断  
						else
							   DataLink_EndFlag=1; //AT_End();  
							   
                         //--------    清除鉴权码 -------------------
					     idip("clear");		   

						}
					else if(pstrTemp[4]=='2')	///备用域名
						{
						rt_kprintf("\r\n设置备用域名 !");
						memset(DomainNameStr_aux,0,sizeof(DomainNameStr_aux));					  
						memset(SysConf_struct.DNSR_Aux,0,sizeof(DomainNameStr_aux));
						memcpy(DomainNameStr_aux,(char*)pstrTempStart,cmdLen);
						memcpy(SysConf_struct.DNSR_Aux,(char*)pstrTempStart,cmdLen);
						Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
						//----- 传给 GSM 模块------
						DataLink_DNSR2_Set(SysConf_struct.DNSR_Aux,1);
						
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);
						}
					else
						{
						continue;
						}
					}
				}
			else if(strncmp(pstrTemp,"PORT",4)==0)			///2. 设置端口
				{
				j=sscanf(sms_content,"%u",&u16Temp);
				if(j)
					{
					if(pstrTemp[4]=='1')		///主端口
						{
						rt_kprintf("\r\n设置主端口=%d!",u16Temp);
						RemotePort_main=u16Temp;
						SysConf_struct.Port_main=u16Temp;
						Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
						//----- 传给 GSM 模块------
						DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);

						//------- add on 2013-6-6
						if(ACKstate==SMS_ACK_none)
						     SD_ACKflag.f_CentreCMDack_0001H=2 ;//DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断  
						else
							  DataLink_EndFlag=1; //AT_End();  

						 //--------    清除鉴权码 -------------------
					     idip("clear");		   	  

						}
					else if(pstrTemp[4]=='2')	///备用端口
						{
						rt_kprintf("\r\n设置备用端口=%d!",u16Temp);
						RemotePort_aux=u16Temp;
						SysConf_struct.Port_Aux=u16Temp;
						Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
						//----- 传给 GSM 模块------
						DataLink_AuxSocket_set(RemoteIP_aux,RemotePort_aux,1);
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);
						}
					else
						{
						continue;
						}
					}
				
				}
			else if(strncmp(pstrTemp,"DUR",3)==0)				///3. 修改发送间隔
				{
				j=sscanf(sms_content,"%u",&u16Temp);
				if(j)
					{
					
						rt_kprintf("\r\n修改发送间隔! %d",u16Temp);
						dur(sms_content);

					///
					Add_SMS_Ack_Content(sms_ack_data,ACKstate);
					}
				}
			else if(strncmp(pstrTemp,"DEVICEID",8)==0)			///4. 修改终端ID
				{
				if(cmdLen<=sizeof(DeviceNumberID))
					{
					rt_kprintf("\r\n修改终端ID  !");
					memset(DeviceNumberID,0,sizeof(DeviceNumberID));
					memcpy(DeviceNumberID,pstrTempStart,cmdLen);
					DF_WriteFlashSector(DF_DeviceID_offset,0,DeviceNumberID,13); 
					///
					Add_SMS_Ack_Content(sms_ack_data,ACKstate);

					 //--------    清除鉴权码 -------------------
					     idip("clear");		     
					
					}
				else
					{
					       continue;
					}
				}    //DeviceNumberID			
				else if(strncmp(pstrTemp,"SIMID",5)==0)			///4. 修改SIMID
				{
				if(cmdLen<=sizeof(SimID_12D))
					{
					rt_kprintf("\r\n修改SIM_ID  !");
					memset(SimID_12D,0,sizeof(SimID_12D));
					memcpy(SimID_12D,pstrTempStart,cmdLen);
					DF_WriteFlashSector(DF_SIMID_12D,0,SimID_12D,13);  
					SIMID_Convert_SIMCODE(); //  转换
					
					///
					Add_SMS_Ack_Content(sms_ack_data,ACKstate);

					 //--------    清除鉴权码 -------------------
					     idip("clear");		     
					
					}
				    else
					{
					       continue;
					}
				}    //DeviceNumberID		
				else if(strncmp(pstrTemp,"PHONENUM",8)==0)			///4. 修改SIMID
				{
				   if(cmdLen==11)
					{
						rt_kprintf("\r\n修改PHONENUM_ID  !"); 
						memset(SimID_12D,0,sizeof(SimID_12D));
						SimID_12D[0]='0'; //    第一位填写 0  
						memcpy(SimID_12D+1,pstrTempStart,cmdLen);
						DF_WriteFlashSector(DF_SIMID_12D,0,SimID_12D,13);  
						SIMID_Convert_SIMCODE(); //  转换
						
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);
						 //--------    清除鉴权码 -------------------
						     idip("clear");		      
					
					}
				else
					{
					       continue;
					}
				}    //DeviceNumberID		
			else if(strncmp(pstrTemp,"IP",2)==0)				///5.设置IP地址
				{
				j = sscanf(sms_content, "%u.%u.%u.%u", (u32*)&u8TempBuf[0], (u32*)&u8TempBuf[1], (u32*)&u8TempBuf[2], (u32*)&u8TempBuf[3]);
				//j=str2ip(sms_content, u8TempBuf);
				if(j==4)
				 	{
				 	rt_kprintf("\r\n设置IP地址!");
					if(pstrTemp[2]=='1')
						{ 
						memcpy(SysConf_struct.IP_Main,u8TempBuf,4);
						memcpy(RemoteIP_main,u8TempBuf,4);
						SysConf_struct.Port_main=RemotePort_main;
						Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
						rt_kprintf("\r\n短信设置主服务器 IP: %d.%d.%d.%d : %d ",RemoteIP_main[0],RemoteIP_main[1],RemoteIP_main[2],RemoteIP_main[3],RemotePort_main);
						//-----------  Below add by Nathan  ----------------------------
						DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);

						if((RemoteIP_main[0]==60)&&(RemoteIP_main[1]==28)&&(RemoteIP_main[2]==50)&&(RemoteIP_main[3]==210)) 
							type_vech(1); 
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);

					     //------- add on 2013-6-6
						if(ACKstate==SMS_ACK_none)
						      SD_ACKflag.f_CentreCMDack_0001H=2 ;//DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断  
						else
							   DataLink_EndFlag=1;

						 //--------    清除鉴权码 -------------------
					     idip("clear");		   

